<template>
  <div>
    <aplayer :list="musicList" :music.sync="music" :listFolded="true" repeat-all slot="display" />
  </div>
</template>

<script>
import Aplayer from "vue-aplayer";

export default {
  name: "MusicPlayer",
  components: {
    Aplayer,
  },
  data() {
    return {
      musicList: [
        {
          title: "浸春芜",
          artist: "塞壬唱片-MSR/宋柏/十音/解伟苓",
          pic: "https://p3.music.126.net/C7f7h50l9-bjqRx9sRsrQw==/109951169299656333.jpg?param=320y320",
          src: "https://m701.music.126.net/20240829180751/74401a1bce1365844ea085221f3d7752/jdymusic/obj/wo3DlMOGwrbDjj7DisKw/33244190327/235b/3fbd/4cab/8fd061ed7e6214a257576c9c5f2aee34.flac",
          lrc: "[00:00.00] 作词 : 宋柏[00:01.00] 作曲 : 十音[00:02.00] 编曲 : 十音[00:31.49]草木生 春耕农忙[00:34.25]风吹薄雾 黄莺歌唱[00:37.89]祈天雨纷纷（来） 迎春照冬藏[00:46.21]日佮暝 如影流光[00:48.97]恍如浮尘 坱埃而翔[00:52.67]愿雨生百谷（来）使千顷田良[00:59.36][00:59.66]（哎）大荒[01:00.64]【霜露改 四季循 何时终?】[01:04.24]夏去秋来 变换平常[01:08.10]无穷[01:08.35]【阳春至 枯木生 何所为？】[01:11.50]林草羽虫 春生秋亡[01:15.25]无休[01:15.56]【日月星 黄道躔 何所成？ 】[01:18.98]玉露风云 天地茫茫[01:22.70]万象 万象[01:30.89][01:31.07]天黑黑 要落雨[01:45.89]天黑黑 要落雨[01:56.80]天黑黑[02:01.83][02:01.91]西风吹 田岸稻芳[02:04.68]日暗鸣蝉 声凉霜降[02:08.33]听雪雨安眠 （来）敛秋收丰长[02:16.55]天地肃 谷粮满仓[02:19.49]风调雨顺 祥瑞安康[02:23.15]顺物候流转（来）使万物生长[02:29.42][02:29.72]（哎）八方[02:31.06]【霜露改 四季循 何时终?】[02:34.62]夏去秋来 变换平常[02:38.27]无穷[02:38.34]【阳春至 枯木生 何所为？】[02:41.98]林草羽虫 春生秋亡[02:45.72]无休[02:45.93]【日月星 黄道躔 何所成？ 】[02:49.37]玉露风云 天地茫茫[02:52.98]万象 万象[03:01.00][03:01.60]天黑黑 要落雨[03:16.20]天黑黑 黑黑",
        },
        {
          title: "202 (New Mix)",
          artist: "ラブリーサマーちゃん",
          pic: "https://p3.music.126.net/ANpwu2WyXDLiA93KtRB64Q==/109951164515417038.jpg?param=320y320",
          src: "https://m8.music.126.net/20240829180652/17f113d9c317f47a86095af579e05a1c/ymusic/065a/5308/535e/1036fac1a8db973895ffd4d28bb08af1.flac",
          lrc: "[00:00.000]作词 : ラブリーサマーちゃん　＆　泉まくら[00:01.000]作曲 : ラブリーサマーちゃん　＆　泉まくら[00:43.560]202号室さようなら (翻译：202号房间，永别了。)[00:46.140]この部屋の春の匂いも (翻译：里面的春天气息)[00:50.600]思い出になるでしょう (翻译：也已化成回忆了吧)[00:54.090]二つ並んだ歯ブラシ (翻译：并肩而立的牙刷)[00:55.870]私には大きすぎるTシャツ (翻译：对我而言过大的T恤)[00:58.270]シェーピングフォームも (翻译：还有这剃须泡沫)[01:00.590]使えないから (翻译：反正都不能用了)[01:01.760]燃えるゴミに出そう (翻译：就扔到可燃垃圾里吧)[01:03.600][01:04.630]甘い苦い辛い酸っぱい (翻译：酸甜苦辣)[01:07.460]色んな気持ち味わって (翻译：五味杂陈)[01:09.960]昔より少し丸くなったよ (翻译：比起以前更胖了)[01:15.260]だんだん好きになって (翻译：渐渐变得喜欢的)[01:17.900]どんどん駄目になった (翻译：却慢慢变得没用的)[01:20.450]君のお下がりの毛布が (翻译：你给的旧毛毯)[01:23.140]暖か過ぎたせい (翻译：都怪这过于暖和的天气)[01:26.350]青い日々が (翻译：晴朗的每一天)[01:28.920]いつまででも (翻译：不知还会)[01:31.190][01:31.690]続くなんて思っていた (翻译：持续到何时)[01:36.950]幼すぎる私たちに (翻译：幼稚无比的我们)[01:42.350]降る土砂降り (翻译：在这倾盆大雨)[01:44.920]酷い目眩 (翻译：眩惑迷离)[01:47.200][02:09.050]足首までの深さ (翻译：陶醉其中)[02:10.690]安心してはしゃいでいた (翻译：无忧无虑地欢闹)[02:14.350]分かりやすいしぐさで (翻译：拙劣的演员一般)[02:16.079]いつもカワイイふりをしていた (翻译：总是假装着可爱)[02:19.090][02:19.810]泡になって消えようと (翻译：将要归于泡影般)[02:21.510]ありったけの熱量で (翻译：用尽全部的热量)[02:23.280]君を見たこと (翻译：看见了你)[02:25.010]そんなのに限って簡単には (翻译：只是不要如此轻易地)[02:27.550][02:28.630]バレないんだもんな (翻译：揭穿我)[02:30.320]いつまでたっても (翻译：不知到了何时)[02:31.710]譲れなかった自分のものさし (翻译：我毫不退让的态度)[02:34.210]退屈になっちゃって (翻译：沦为了厌倦)[02:36.020]二人して投げたさじ遠く遠く (翻译：两人随意的琐事逐渐远去)[02:39.020]もうあの甘いのも掬えない (翻译：再也找不回那份甜蜜)[02:42.610]向こうで待つ新しい背景に (翻译：从今以后等待的某人)[02:46.170]君を重ねることもない (翻译：再也看不到你的影子)[02:48.910]なのに思い出すのは同じ日 (翻译：然而回忆起的还是同一天)[02:51.660]明日はどこで (翻译：将来的某地)[02:54.240]誰の夢を見ているだろう (翻译：又会梦见谁呢)[02:59.630]私たちは (翻译：我们)[03:02.220]水に濡れたロウソクみたい (翻译：就如同被水沾湿的蜡烛)[03:07.610]さようならすら言えないまま (翻译：连句再见也没能说一声)[03:12.550][03:35.250]あっけないんだね (翻译：太没意思了)[03:39.540]こんなことって (翻译：这种事情)[03:41.780]どっかで分かっていたなら (翻译：假若在何处能相知)[03:45.150][03:46.370]歌ってあげるさよなら (翻译：便为你唱首送别之歌)[03:48.680][03:49.330]今更だけど隠さずに (翻译：事到如今已无法遮掩)[03:51.780]不思議と響くナチュラルに (翻译：在这不可思议的大自然影响下)[03:54.490][03:55.800]ぬるい日差しに騙されて (翻译：被这暖阳所欺骗)[04:00.930]段ボールに何を詰めた? (翻译：小纸箱里要塞进什么呢)[04:06.300]この街には帰らないよ (翻译：再也不回到这地方了)[04:11.610]帰れないよ (翻译：不回来了)[04:14.240]悪い夢から醒ましてよ (翻译：从恶梦中醒来吧)",
        },
        {
          title: "El último baile",
          artist: "KθZyo",
          pic: "https://p3.music.126.net/ULZ5FRJH4WH7BSb7d4MslA==/109951169056709127.jpg?param=320y320",
          src: "https://m701.music.126.net/20240829180604/1be39e35a27d8903228264eadfba8d27/jdymusic/obj/wo3DlMOGwrbDjj7DisKw/31531134752/a79f/11b6/0fd2/a1e832be3e0af0f6406e1b52a1be7b4e.flac",
          lrc: "[00:05.00]纯音乐，请欣赏",
        },
      ],
      music: {
        title: "浸春芜",
          artist: "塞壬唱片-MSR/宋柏/十音/解伟苓",
          pic: "https://p3.music.126.net/C7f7h50l9-bjqRx9sRsrQw==/109951169299656333.jpg?param=320y320",
          src: "https://m701.music.126.net/20240829180751/74401a1bce1365844ea085221f3d7752/jdymusic/obj/wo3DlMOGwrbDjj7DisKw/33244190327/235b/3fbd/4cab/8fd061ed7e6214a257576c9c5f2aee34.flac",
          lrc: "[00:00.00] 作词 : 宋柏[00:01.00] 作曲 : 十音[00:02.00] 编曲 : 十音[00:31.49]草木生 春耕农忙[00:34.25]风吹薄雾 黄莺歌唱[00:37.89]祈天雨纷纷（来） 迎春照冬藏[00:46.21]日佮暝 如影流光[00:48.97]恍如浮尘 坱埃而翔[00:52.67]愿雨生百谷（来）使千顷田良[00:59.36][00:59.66]（哎）大荒[01:00.64]【霜露改 四季循 何时终?】[01:04.24]夏去秋来 变换平常[01:08.10]无穷[01:08.35]【阳春至 枯木生 何所为？】[01:11.50]林草羽虫 春生秋亡[01:15.25]无休[01:15.56]【日月星 黄道躔 何所成？ 】[01:18.98]玉露风云 天地茫茫[01:22.70]万象 万象[01:30.89][01:31.07]天黑黑 要落雨[01:45.89]天黑黑 要落雨[01:56.80]天黑黑[02:01.83][02:01.91]西风吹 田岸稻芳[02:04.68]日暗鸣蝉 声凉霜降[02:08.33]听雪雨安眠 （来）敛秋收丰长[02:16.55]天地肃 谷粮满仓[02:19.49]风调雨顺 祥瑞安康[02:23.15]顺物候流转（来）使万物生长[02:29.42][02:29.72]（哎）八方[02:31.06]【霜露改 四季循 何时终?】[02:34.62]夏去秋来 变换平常[02:38.27]无穷[02:38.34]【阳春至 枯木生 何所为？】[02:41.98]林草羽虫 春生秋亡[02:45.72]无休[02:45.93]【日月星 黄道躔 何所成？ 】[02:49.37]玉露风云 天地茫茫[02:52.98]万象 万象[03:01.00][03:01.60]天黑黑 要落雨[03:16.20]天黑黑 黑黑",
        },
    };
  },
};
</script>

<style scoped>
.aplayer {
  width: 100%;
  border-radius: 5px;
}
</style>
